////201612-2
////µÈ´ý²âÆÀ~
//#include <iostream>
//using namespace std;
//
//int GetAfterTax(int S)
//{
//	if (S <= 3500) return S;
//	int A = S - 3500;
//	int tax = 0;
//	if (A <= 1500)
//	{
//		tax += A*0.03;
//	}
//	else if (1500 < A && A <= 4500)
//	{
//		tax += 1500 * 0.03;
//		tax += (A - 1500)*0.1;
//	}
//	else if (4500 < A && A <= 9000)
//	{
//		tax += 1500 * 0.03;
//		tax += 3000 * 0.1;
//		tax += (A - 4500)*0.2;
//	}
//	else if (9000 < A && A <= 35000)
//	{
//		tax += 1500 * 0.03;
//		tax += 3000 * 0.1;
//		tax += 4500 * 0.2;
//		tax += (A - 9000)*0.25;
//	}
//	else if (35000 < A && A <= 55000)
//	{
//		tax += 1500 * 0.03;
//		tax += 3000 * 0.1;
//		tax += 4500 * 0.2;
//		tax += (35000 - 9000)*0.25;
//		tax += (A - 35000)*0.3;
//	}
//	else if (55000 < A && A <= 80000)
//	{
//		tax += 1500 * 0.03;
//		tax += 3000 * 0.1;
//		tax += 4500 * 0.2;
//		tax += (35000 - 9000)*0.25;
//		tax += (55000 - 35000)*0.3;
//		tax += (A - 55000)*0.35;
//	}
//	else if (80000 < A)
//	{
//		tax += 1500 * 0.03;
//		tax += 3000 * 0.1;
//		tax += 4500 * 0.2;
//		tax += (35000 - 9000)*0.25;
//		tax += (55000 - 35000)*0.3;
//		tax += (80000 - 55000)*0.35;
//		tax += (A - 80000)*0.45;
//	}
//	return S - tax;
//}
//int main()
//{
//	int T = 0;
//	cin >> T;
//	int guessS = T / 100, guessT = 0;
//
//	while (true)
//	{
//		guessT = GetAfterTax(guessS * 100);
//		if (guessT == T)
//		{
//			cout << guessS * 100 << endl;
//			break;
//		}
//		else
//		{
//			guessS++;
//		}
//	}
//	return 0;
//}